testCase3_interFoam_KVLCC2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          192;
        startFace       4192;
    }
    inlet
    {
        type            patch;
        nFaces          96;
        startFace       4384;
    }
    outlet
    {
        type            patch;
        nFaces          96;
        startFace       4480;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          192;
        startFace       4576;
    }
    side1
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          128;
        startFace       4768;
    }
    side2
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          128;
        startFace       4896;
    }
)

// ************************************************************************* //
