testCase3_interFoam_KVLCC2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "alpha.water.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 1;
        cAlpha          1;
        icAlpha         0;

        MULESCorr       yes;
        nLimiterIter    10;
        alphaApplyPrevCorr  yes;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }


    "pcorr.*"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            smoother        GaussSeidel;
            tolerance       1e-5;
            relTol          0;
        };
        tolerance       1e-5;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-7;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|k|omega).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         1;
        tolerance       1e-7;
        relTol          0.1;
        minIter         1;
    }

    Phi
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-06;
        relTol          0.01;
    }




"cellDisplacement.*"
        {
                solver       GAMG;
                smoother     GaussSeidel;
                tolerance    1e-09;
                relTol       0;
        }
        yPsi
        {
                solver       GAMG;
                smoother     GaussSeidel;
                tolerance    1e-09;
                relTol       0.0;
        }
        yPsiFinal
        {
                $yPsi;
        }
}


PIMPLE
{
    momentumPredictor   no;

    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 3;

    maxCo               10;
    maxAlphaCo          5;
     consistent yes;
    rDeltaTSmoothingCoeff 0.05;
    rDeltaTDampingCoeff 0.5;
    nAlphaSpreadIter    0;
    nAlphaSweepIter     0;
    maxDeltaT           1;


    residualControl
    {
     	"(p_rgh|U|k|omega)"
     	{
      		tolerance 1e-4;
      		relTol 0.01;
     	}
    }

}


SIMPLE
{
	    nNonOrthogonalCorrectors 2;
	        consistent yes;
residualControl
{
	    p           1e-4;
	     U   1e-4;
}

}
potentialFlow
{
	    nNonOrthogonalCorrectors 10;
	        consistent yes;
}


relaxationFactors
{
	equations
	{
		".*" 1;
	}
}


cache
{
    grad(U);
}


// ************************************************************************* //
